import random

import word_file

print("______________________________________________________________")
print("|     -----------Welcome to the game Hangman----------       |")
print("|     |____________                                          |")
print("|     |      |                                               |")
print("|     |      O                                               |")
print("|     |     /|\                                              |")
print("|     |     / \                                              |")
print("|     |                                                      |")
print("|     ===============")
print("--------------------------------------------------------------")
print(" ")
item=random.choice(word_file.word)
quize=list(item)
word=["_"]*len(item)
guess=[]
lives=6
game_over=False
print("LETTERS : ",len(word))
while not game_over:
    index=[]
    print(" ")
    n=input("Guess the word :  ")
    if n in guess:
        print(" ")
        print(" YOU AlREADY USED THAT CHARACTER ! ")
        continue
    else:
        guess.append(n)
    for i in range(len(quize)):
        if n==quize[i]:
            word[i]=n
    print(" ")
    print("Character matched 🎉" , word)
    print("  ")

    if n not in quize:
        lives-=1
        print(" ")
        print("Oops! Wrong character  ", word)
        print("           ")
        print("lives remaining ",lives)
        print(' ')
    if lives==0:
        game_over=True
        print("""                 q
              ███████████████████████████
                 ███████▀▀▀░░░░░░░▀▀▀███████
                 ████▀░░░░░░░░░░░░░░░░░▀████
                 ███│░░░░░░░░░░░░░░░░░░░│███
                 ██▌│░░░░░░░░░░░░░░░░░░░│▐██
                 ██░└┐░░░░░░░░░░░░░░░░░┌┘░██
                 ██░░└┐░░░░░░░░░░░░░░░┌┘░░██
                 ██░░┌┘▄▄▄▄▄░░░░░▄▄▄▄▄└┐░░██
                 ██▌░│██████▌░░░▐██████│░▐██
                 ███░│▐███▀▀░░▄░░▀▀███▌│░███
                 ██▀─┘░░░░░░░▐█▌░░░░░░░└─▀██
                 ██▄░░░▄▄▄▓░░▀█▀░░▓▄▄▄░░░▄██
                 ████▄─┘██▌░░░░░░░▐██└─▄████
                 █████░░▐█─┬┬┬┬┬┬┬─█▌░░█████
                 ████▌░░░▀┬┼┼┼┼┼┼┼┬▀░░░▐████
                 █████▄░░░└┴┴┴┴┴┴┴┘░░░▄█████
                 ███████▄░░░░░░░░░░░▄███████
                 ██████████▄▄▄▄▄▄▄██████████""")
        print('YOU LOSE ☠️')
    if "_" not in word:
        game_over=True
        print("""⠀⠀⠀  ⠀⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀
                 ⠀⠀ ⣀⠀⢀⣶⣿⡛⠛⠋⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠙⠛⢛⣿⣶⡄⠀⣀⠀⠀
                 ⠀⠀ ⣿⣧⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣼⣿⠀⠀
                    ⣿⡏⠉⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠉⢹⣿⠀⠀
⠀⠀                  ⢻⣧⠀⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠀⣼⡏⠀⠀
⠀                ⠀  ⠘⣿⡄⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⢰⣿⠃⠀⠀
⠀           ⠀     ⠀  ⠹⣷⡀⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⢠⣿⡏⠀⠀⠀
⠀⠀                ⠀⠀  ⢻⣿⣄⢀⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⣠⣿⡟⠀⠀⠀⠀
⠀⠀⠀⠀                ⠀  ⠙⣿⣾⡿⠋⠻⣿⣿⣿⣿⣿⣿⣿⣿⠟⠙⢿⣿⣿⠏⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀                  ⠈⠻⠟⠀⠀⠀⢹⣿⣿⣿⣿⡏⠀⠀⠀⠻⠟⠁⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀         ⠀⠀⠀         ⠀⠈⢻⣿⣿⣿⣿⡟⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀                ⠀  ⠀⠀⢸⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀                  ⣀⣴⣿⣿⣿⣿⣿⣿⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀               ⠀   ⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀                ⠀⠀⠀  ⠈⠉⠉⠉⠉⠛⠛⠛⠛⠉⠉⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀""")
        print("YOU WON 😎")
print("WORD IS : ",item)
l=int(input(""))
print(" ")
print("---GAME OVER---")